<%@ page language="java" import="java.util.*" pageEncoding="utf-8"%>
<%
String path = request.getContextPath();
String basePath = request.getScheme()+"://"+request.getServerName()+":"+request.getServerPort()+path+"/";
%>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <base href="<%=basePath%>">
    
    <title>My JSP 'intruduce2.jsp' starting page</title>
    
	<meta http-equiv="pragma" content="no-cache">
	<meta http-equiv="cache-control" content="no-cache">
	<meta http-equiv="expires" content="0">    
	<meta http-equiv="keywords" content="keyword1,keyword2,keyword3">
	<meta http-equiv="description" content="This is my page">
	<!--
	<link rel="stylesheet" type="text/css" href="styles.css">
	-->

  </head>
  
  <body bgcolor="#336699">
  <p>
  <pre>
                                                                                             用户注册协议书
    
    
     尊敬的用户，欢迎您的注册并成为我们的会员。
    在注册及使用前请您仔细阅读如下服务条款：
    本服务条款系由用户与腾龙公司(以下简称“网易”)就网易提供的邮箱服务所订立的相关权利义务规范。因此，请于注册成为网易邮箱用户前，确实详细阅读本服务条款的所有内容，当您点选同意键或定制、使用、接受网易邮箱服务时即视为您已仔细阅读本条款，同意接受本服务条款的所有规范并愿受其拘束，本服务条款对您及网易均具有法律效力。
1、服务条款的确认和接纳
    网易服务的所有权、运作权和解释权归网易公司所有。所提供的服务必须按照其发布的公司章程，服务条款和操作规则严格执行。
2、服务简介
    网易运用自己的操作系统通过国际互联网络为用户提供各项服务，而这种服务是免费的。用户必须：
    (1)提供设备，包括个人电脑一台、调制解调器一个及配备上网装置。 
    (2)个人上网和支付与此服务有关的电话费用。 而且对此设备的可用性由用户个人承担，网易对此不承担任何责任。
    考虑到网易产品服务的重要性，用户同意：
    (1)提供及时、详尽及准确的个人资料。
    (2)不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。
    (3)网易不能也不会对您的资料不真实、不准确，或您的资料未能及时更新，或因您丢失了身份号码和密码而引起的任何损失或损害承担责任。对上传虚假、黄色图片的会员，我们保留删除图片、论坛留言、终止会员资格、追究法律责任的权利
    另外，用户可授权网易公司向第三方透露其注册资料，否则网易公司不能公开用户的姓名、住址、出件地址、电子邮箱、帐号。除非：
    (1)用户要求网易公司或授权某人通过电子邮件服务透露这些信息。 
    (2)相应的法律、法规要求及程序服务需要网易公司提供用户的个人资料。
    如果用户提供的资料不准确，不真实，不合法有效，网易公司保留结束用户使用网易各项服务的权利。
    用户在享用网易各项服务的同时，同意接受网易提供的各类信息服务。 
3、服务条款的修改
    网易公司会在必要时修改服务条款，网易服务条款一旦发生变动，公司将会在用户进入下一步使用前的页面提示修改内容。如果您同意改动，则再一次激活"我同意"按钮。如果您不接受，则及时取消您的用户使用服务资格。
    用户要继续使用网易各项服务需要两方面的确认：
    (1)首先确认网易服务条款及其变动。
    (2)同意接受所有的服务条款限制。
4、服务修订
    网易公司保留随时修改或中断服务而不需通知用户的权利。用户接受网易公司行使修改或中断服务的权利，网易公司不需对用户或第三方负责。
5、用户隐私制度
    尊重用户个人隐私是网易公司的一项基本政策。所以，作为对以上第二点个人注册资料分析的补充，网易公司一定不会公开、编辑或透露用户的注册资料及保存在网易各项服务中的非公开内容，除非网易公司在诚信的基础上认为透露这些信息在以下几种情况是必要的： 
    (1)遵守有关法律规定，包括在国家有关机关查询时，提供用户在网易的网页上发布的信息内容及其发布时间、互联网地址或者域名。
    (2)遵从网易产品服务程序。 
    (3)保持维护网易的商标所有权。
    (4)在紧急情况下竭力维护用户个人和社会大众的隐私安全。
    (5)根据第11条的规定或者网易认为必要的其他情况下。 用户在此授权网易可以向其电子邮箱发送商业信息。 
6、用户的帐号、密码和安全性
    您一旦注册成功成为用户，您将得到一个密码和帐号。如果您未保管好自己的帐号和密码而对您、网易或第三方造成的损害，您将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。您可随时改变您的密码和图标，也可以结束旧的帐户重开一个新帐户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告网易公司。
7、拒绝提供担保
    用户明确同意邮件服务的使用由用户个人承担风险。服务提供是建立在免费的基础上。网易公司明确表示不提供任何类型的担保，不论是明确的或隐含的，但是对商业性的隐含担保，特定目的和不违反规定的适当担保除外。网易公司不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、出错发生都不作担保。网易公司拒绝提供任何担保，包括信息能否准确、及时、顺利地传送。用户理解并接受下载或通过网易产品服务取得的任何信息资料取决于用户自己，并由其承担系统受损或资料丢失的所有风险和责任。网易公司对在服务网上得到的任何商品购物服务或交易进程，都不作担保。用户不会从网易公司收到口头或书面的意见或信息，网易也不会在这里作明确担保。
8、有限责任
    (1)网易公司对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用产品服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或用户传送的信息有所变动。这些损害会导致网易公司形象受损，所以网易公司早已提出这种损害的可能性。
    (2)网易对本项服务下涉及的境内外基础电信运营商的移动通信网络的故障、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机或其他非网易技术能力范围内的事因等造成的服务中断、用户发送的短信息的内容丢失、出现乱码、错误接收、无法接收、迟延接收不作担保
    (3)用户同意网易对任何他人的威胁性的、诽谤性的、淫秽的、令人反感的或非法的内容或行为或对权利的侵犯(包括知识产权)不承担责任；且对任何第三方通过服务发送和/或在服务中包含的任何内容不承担责任
9、不提供零售和商业性服务
    用户使用网易各项服务的权利是个人的。用户只能是一个单独的个体而不能是一个公司或实体的商业性组织。用户承诺不经网易公司同意，不能利用网易各项服务进行销售或其他商业用途。
10、用户管理
    用户单独承担发布内容的责任。用户对服务的使用是根据所有适用于服务的地方法律、国家法律和国际法律标准的。用户承诺：
    (1)在网易的网页上发布信息或者利用网易的服务时必须符合中国有关法规(部分法规请见附录)，不得在网易的网页上或者利用网易的服务制作、复制、发布、传播以下信息：
      (a)反对宪法所确定的基本原则的；
      (b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
      (c) 损害国家荣誉和利益的；
      (d) 煽动民族仇恨、民族歧视，破坏民族团结的；
      (e) 破坏国家宗教政策，宣扬邪教和封建迷信的；
      (f) 散布谣言，扰乱社会秩序，破坏社会稳定的；
      (g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
      (h) 侮辱或者诽谤他人，侵害他人合法权益的；
      (i) 含有法律、行政法规禁止的其他内容的。
    (2)在网易的网页上发布信息或者利用网易的服务时还必须符合其他有关国家和地区的法律规定以及国际法的有关规定。
    (3)不利用网易的服务从事以下活动：
      (a) 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
      (b) 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
      (c) 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
      (d) 故意制作、传播计算机病毒等破坏性程序的；
      (e) 其他危害计算机信息网络安全的行为。
    (4)不以任何方式干扰网易的服务。不得针对本服务、与本服务连接的服务器或网络制造干扰、混乱，或违反连接本服务的网络的任何要求、程序、政策或规则，否则网易将保留追究其法律责任的权利并有权将其提交给相关部门处理；
    (5)用户需对自己在网上的行为承担法律责任。用户若在网易网上散布和传播含有不雅字眼、反动、色情或其他违反国家法律、法规或相关政策的信息，网易的系统记录有可能作为用户违反法律的证据；
    (6)遵守网易的所有其他规定和程序。
    用户需对自己在使用网易服务过程中的行为承担法律责任。用户理解，如果网易发现其网站传输的信息明显属于上段第(1)条所列内容之一，依据中国法律，网易有义务立即停止传输，保存有关记录，向国家有关机关报告，并且删除含有该内容的地址、目录或关闭服务器。若用户的行为不符合以上提到的服务条款，网易公司将作出独立判断立即取消用户服务帐号。
11、保障
    用户同意保障和维护网易公司全体成员的利益，负责支付由用户使用超出服务范围引起的律师费用，违反服务条款的损害补偿费用，其它人使用用户的电脑、帐号和其它知识产权的追索费。
12、结束服务
    用户或网易公司可随时根据实际情况中断服务。网易公司不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的变更或对后来的条款修改有异议，或对网易服务不满，用户只有以下的追索权：
    (1)不再使用网易服务。
    (2)结束用户使用网易服务的资格。 
    (3)通告网易公司停止该用户的服务。
    结束用户服务后，用户使用网易服务的权利马上中止。从那时起，网易公司不再对用户承担任何义务。 
13、通告
    所有发给用户的通告都可通过电子邮件或常规的信件传送。网易公司会通过邮件服务发报消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。同时，网易公司保留对申请了126.com免费邮箱的用户投放商业性广告的权利。
14、参与广告策划
    在网易公司许可下用户可在他们发表的信息中加入宣传资料或参与广告策划，在网易各项免费服务上展示他们的产品。任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和广告销售商之间发生。网易公司不承担任何责任，网易公司没有义务为这类广告销售负任何一部分的责任。
15、内容的所有权
    内容的定义包括：文字、软件、声音、相片、录象、图表；在广告中的全部内容；电子邮件的全部内容；网易虚拟社区服务为用户提供的商业信息。所有这些内容均受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在网易公司和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。 
16、法律
    用户和网易公司一致同意有关本协议,对于使用网易的服务产生的争议，网易有权选择受理该诉讼的有管辖权的法院。本服务条款之效力和解释均适用中华人民共和国之法律。如服务条款之任何一部分与中华人民共和国法律相抵触，则该部分条款应按法律规定重新解释，部分条款之无效或重新解释不影响其它条款之法律效力。 

</pre>
  </body>
</html>
