<%@ page language="java" import="java.util.*" pageEncoding="utf-8"%>
<%
String path = request.getContextPath();
String basePath = request.getScheme()+"://"+request.getServerName()+":"+request.getServerPort()+path+"/";
%>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <base href="<%=basePath%>">
    
    <title>My JSP 'intruduce.jsp' starting page</title>
    
	<meta http-equiv="pragma" content="no-cache">
	<meta http-equiv="cache-control" content="no-cache">
	<meta http-equiv="expires" content="0">    
	<meta http-equiv="keywords" content="keyword1,keyword2,keyword3">
	<meta http-equiv="description" content="This is my page">
	<!--
	<link rel="stylesheet" type="text/css" href="styles.css">
	-->

  </head>
  
  <body bgcolor="#336699">
  <p>
  <pre>
                                                                         腾龙大酒店预订酒店须知
1.预订

1.1   在线预订

为确保您的行程，在您填写预订单时，务必留下准确入住人姓名（请确保与所使用的有效证件上的姓名一致）及联系人手机号码。

1.2   最晚修改及取消时间

预付及担保订单有规定的最晚修改及取消时间，超过最晚修改及取消时间将可能给您造成损失，具体以酒店取消规则为准。

1.3   当您需要预订多间客房时，须提供不少于所预订客房数量的实际入住人的信息，入住人姓名需要不同，以方便预订确认。

2.费用说明

2.1   网站前台呈现的酒店价格为酒店房费，不包含酒店其他费用及税收。

2.2   网站价格可能因为酒店原因会有所变更，请以最终确认为准。

2.3   您入住酒店的早餐与加床价格视各酒店规定有所不同。

3.入住、延住与离店

3.1   通常情况下，酒店的最早入住时间为 14： 00，最晚离店时间为正午 12： 00。

3.1.1     若您提前入住，请与酒店协商，可能会遇到无空房的情况，需要您等待。

3.1.2     若您推迟离店，需与酒店协商，酒店一般会加收一定的费用。

3.2   请您在预订填写订单信息时注明的最晚到店时间前到达酒店，如未能如期到达请及时与酒店联系，否则酒店将会取消您的订单。

3.3   产品均为即时计价，请以我方最终确认价格为准。

4.您的权利和责任

4.1   若订单已确认，您可如期入住所预订的酒店。

4.2   若订单已确认，您在约定时间至预订酒店前台发现无房，请立即拨打电话通知酒店，以便我们尽快帮您协调解决。

4.3   您对您的订房亦负有相应的承诺，如由于您已预付房款后而未入住所造成的损失亦将由您承担。如您在酒店入住时遇到困难，请致电酒店服务热线，酒店将为您提供必要的帮助。

5.关于信用卡担保

5.1   当旅游旺季、节假日期间或举办大型会展期间酒店房间紧张等情况下，部分酒店需要您提供信用卡担保。

5.2   信用卡担保所支持的卡种以系统提示为准，并请您提供正确的信用卡信息，如信息不正确或通不过系统审核，则您将无法预订需要担保的酒店。

5.3   需要信用卡担保的酒店，订单一经确认将不可取消或修改。因此请在填写担保订单前请慎重考虑您是否会修改行程，以免给您造成不必要的损失。

5.4   如您未按订单时间或房间数量入住，酒店将按国际惯例扣除相应的房费。

6.免责条款

6.1   腾龙大酒店网酒店产品页显示特定地点的酒店信息，但不代表建议去这些地方旅行或认为没有风险， 对于去这些地方旅行造成的损害或损失腾龙大酒店网不承担任何责任。

6.2   腾龙大酒店网对您入住酒店期间发生的意外不承担任何责任。建议您查看将要去旅行的国家政府发布的相关旅行公告，并采取必要的预防措施。 同时建议您购买个人旅行保险。

6.3   如您被法院列入全国失信被执行人名单，您可能无法正常出游，您可以于预订前自行核实，避免不必要的损失。

Copyright © 2006- 腾龙大酒店网 Tenglong.com

</pre>
</p>
  </body>
</html>
